spec/support/vcr_cassettes/bgs/vnp_proc_service_v2/vnp_proc_form_service.yml

---
http_interactions:
- request:
    method: get
    uri: https://localhost:4447/VnpProcFormWebServiceBean/VnpProcFormService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v2.9.0
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 26 Mar 2024 18:20:34 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b230824.1031 svn-revision#e4bad6ac24018736698e2952f77e76e7f403a9f1. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b230824.1031 svn-revision#e4bad6ac24018736698e2952f77e76e7f403a9f1. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://procFormService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://procFormService.services.vonapp.vba.va.gov/" name="VnpProcFormService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://procFormService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpProcFormWebServiceBean/VnpProcFormService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="findAllAsArray">
        <part name="parameters" element="tns:findAllAsArray"/>
        </message>
        <message name="findAllAsArrayResponse">
        <part name="parameters" element="tns:findAllAsArrayResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="vnpProcFormFindByPrimaryKey">
        <part name="parameters" element="tns:vnpProcFormFindByPrimaryKey"/>
        </message>
        <message name="vnpProcFormFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpProcFormFindByPrimaryKeyResponse"/>
        </message>
        <message name="vnpProcFormRemove">
        <part name="parameters" element="tns:vnpProcFormRemove"/>
        </message>
        <message name="vnpProcFormRemoveResponse">
        <part name="parameters" element="tns:vnpProcFormRemoveResponse"/>
        </message>
        <message name="vnpProcFormCreate">
        <part name="parameters" element="tns:vnpProcFormCreate"/>
        </message>
        <message name="vnpProcFormCreateResponse">
        <part name="parameters" element="tns:vnpProcFormCreateResponse"/>
        </message>
        <portType name="VnpProcFormService">
        <operation name="findAllAsArray">
        <input wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/findAllAsArrayRequest" message="tns:findAllAsArray"/>
        <output wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/findAllAsArrayResponse" message="tns:findAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/findAllAsArray/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpProcFormFindByPrimaryKey">
        <input wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/vnpProcFormFindByPrimaryKeyRequest" message="tns:vnpProcFormFindByPrimaryKey"/>
        <output wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/vnpProcFormFindByPrimaryKeyResponse" message="tns:vnpProcFormFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/vnpProcFormFindByPrimaryKey/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpProcFormRemove">
        <input wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/vnpProcFormRemoveRequest" message="tns:vnpProcFormRemove"/>
        <output wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/vnpProcFormRemoveResponse" message="tns:vnpProcFormRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/vnpProcFormRemove/Fault/MessageFaultException"/>
        </operation>
        <operation name="vnpProcFormCreate">
        <input wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/vnpProcFormCreateRequest" message="tns:vnpProcFormCreate"/>
        <output wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/vnpProcFormCreateResponse" message="tns:vnpProcFormCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException" wsam:Action="http://procFormService.services.vonapp.vba.va.gov/VnpProcFormService/vnpProcFormCreate/Fault/MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpProcFormServicePortBinding" type="tns:VnpProcFormService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="findAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpProcFormFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpProcFormRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpProcFormCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpProcFormService">
        <port name="VnpProcFormServicePort" binding="tns:VnpProcFormServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpProcFormWebServiceBean/VnpProcFormService"/>
        </port>
        </service>
        </definitions>
  recorded_at: Tue, 26 Mar 2024 18:20:34 GMT
- request:
    method: post
    uri: https://localhost:4447/VnpProcFormWebServiceBean/VnpProcFormService
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="UTF-8"?>
          <env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://procFormService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
          <env:Header>
          <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
              <wsse:Username>VAgovAPI</wsse:Username>
            </wsse:UsernameToken>
            <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
              <vaws:CLIENT_MACHINE>192.168.0.9</vaws:CLIENT_MACHINE>
              <vaws:STN_ID>281</vaws:STN_ID>
              <vaws:applicationName>VAgovAPI</vaws:applicationName>
              <vaws:ExternalUid>xUid</vaws:ExternalUid>
              <vaws:ExternalKey>xKey</vaws:ExternalKey>
            </vaws:VaServiceHeaders>
          </wsse:Security>
        </env:Header>

          <env:Body>
            <tns:vnpProcFormCreate>
              <arg0>
          <VnpProcFormDTO>
            <compId>
               <vnpProcId/>
               <formTypeCd>21-22</formTypeCd>
            </compId>
            <jrnDt/>
            <jrnLctnId/>
            <jrnObjId/>
            <jrnStatusTypeCd/>
            <jrnUserId/>
          </VnpProcFormDTO>
        </arg0>

            </tns:vnpProcFormCreate>
          </env:Body>
          </env:Envelope>
    headers:
      User-Agent:
      - Faraday v2.9.0
      Content-Type:
      - text/xml;charset=UTF-8
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpProcFormCreate"'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 500
      message: Internal Server Error
    headers:
      Date:
      - Tue, 26 Mar 2024 18:20:35 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      X-Oracle-Dms-Ecid:
      - 2816874f-ef7b-4a50-9f2b-bd3cee82a6db-000bb5a3
      X-Oracle-Dms-Rid:
      - '0'
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
      Strict-Transport-Security:
      - max-age=16000000; includeSubDomains; preload;
    body:
      encoding: UTF-8
      string: "<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Header><WorkContext
        xmlns=\"http://oracle.com/weblogic/soap/workarea/\">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</WorkContext></S:Header><S:Body><ns0:Fault
        xmlns:ns0=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:ns1=\"http://www.w3.org/2003/05/soap-envelope\"><faultcode>ns0:Server</faultcode><faultstring>EJB
        Exception: : java.lang.NullPointerException\n\tat gov.va.vba.vonapp.services.procFormService.VnpProcFormWebServiceBean.vnpProcFormCreate(Unknown
        Source)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n\tat
        sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:62)\n\tat
        sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)\n\tat
        java.lang.reflect.Method.invoke(Method.java:498)\n\tat com.bea.core.repackaged.springframework.aop.support.AopUtils.invokeJoinpointUsingReflection(AopUtils.java:344)\n\tat
        com.bea.core.repackaged.springframework.aop.framework.ReflectiveMethodInvocation.invokeJoinpoint(ReflectiveMethodInvocation.java:198)\n\tat
        com.bea.core.repackaged.springframework.aop.framework.ReflectiveMethodInvocation.proceed(ReflectiveMethodInvocation.java:163)\n\tat
        com.oracle.pitchfork.intercept.MethodInvocationInvocationContext.proceed(MethodInvocationInvocationContext.java:101)\n\tat
        com.oracle.pitchfork.intercept.JeeInterceptorInterceptor.invoke(JeeInterceptorInterceptor.java:101)\n\tat
        com.bea.core.repackaged.springframework.aop.framework.ReflectiveMethodInvocation.proceed(ReflectiveMethodInvocation.java:186)\n\tat
        com.oracle.pitchfork.intercept.MethodInvocationInvocationContext.proceed(MethodInvocationInvocationContext.java:101)\n\tat
        org.jboss.weld.ejb.AbstractEJBRequestScopeActivationInterceptor.aroundInvoke(AbstractEJBRequestScopeActivationInterceptor.java:73)\n\tat
        org.jboss.weld.ejb.SessionBeanInterceptor.aroundInvoke(SessionBeanInterceptor.java:52)\n\tat
        sun.reflect.GeneratedMethodAccessor30057.invoke(Unknown Source)\n\tat sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)\n\tat
        java.lang.reflect.Method.invoke(Method.java:498)\n\tat com.oracle.pitchfork.intercept.JeeInterceptorInterceptor.invoke(JeeInterceptorInterceptor.java:94)\n\tat
        com.bea.core.repackaged.springframework.aop.framework.ReflectiveMethodInvocation.proceed(ReflectiveMethodInvocation.java:186)\n\tat
        com.bea.core.repackaged.springframework.aop.support.DelegatingIntroductionInterceptor.doProceed(DelegatingIntroductionInterceptor.java:136)\n\tat
        com.bea.core.repackaged.springframework.aop.support.DelegatingIntroductionInterceptor.invoke(DelegatingIntroductionInterceptor.java:124)\n\tat
        com.bea.core.repackaged.springframework.aop.framework.ReflectiveMethodInvocation.proceed(ReflectiveMethodInvocation.java:186)\n\tat
        com.bea.core.repackaged.springframework.aop.framework.JdkDynamicAopProxy.invoke(JdkDynamicAopProxy.java:212)\n\tat
        com.sun.proxy.$Proxy2450.vnpProcFormCreate(Unknown Source)\n\tat gov.va.vba.vonapp.services.procFormService.VnpProcFormWebServiceBean_b3ox9c_WSOImpl.__WL_invoke(Unknown
        Source)\n\tat weblogic.ejb.container.internal.WSOMethodInvoker.invoke(WSOMethodInvoker.java:24)\n\tat
        gov.va.vba.vonapp.services.procFormService.VnpProcFormWebServiceBean_b3ox9c_WSOImpl.__WL_vnpProcFormCreate_WS(Unknown
        Source)\n\tat sun.reflect.NativeMethodAccessorImpl.invoke0(Native Method)\n\tat
        sun.reflect.NativeMethodAccessorImpl.invoke(NativeMethodAccessorImpl.java:62)\n\tat
        sun.reflect.DelegatingMethodAccessorImpl.invoke(DelegatingMethodAccessorImpl.java:43)\n\tat
        java.lang.reflect.Method.invoke(Method.java:498)\n\tat weblogic.wsee.server.ejb.WsEjb.invoke(WsEjb.java:55)\n\tat
        weblogic.wsee.jaxws.WLSEjbInstanceResolver$WLSEjbInvoker.invoke(WLSEjbInstanceResolver.java:196)\n\tat
        weblogic.wsee.jaxws.WLSInstanceResolver$WLSInvoker.invoke(WLSInstanceResolver.java:93)\n\tat
        com.sun.xml.ws.server.InvokerTube$2.invoke(InvokerTube.java:149)\n\tat com.sun.xml.ws.server.sei.SEIInvokerTube.processRequest(SEIInvokerTube.java:88)\n\tat
        com.sun.xml.ws.api.pipe.Fiber.__doRun(Fiber.java:1136)\n\tat com.sun.xml.ws.api.pipe.Fiber._doRun(Fiber.java:1050)\n\tat
        com.sun.xml.ws.api.pipe.Fiber.doRun(Fiber.java:1019)\n\tat com.sun.xml.ws.api.pipe.Fiber.runSync(Fiber.java:877)\n\tat
        com.sun.xml.ws.server.WSEndpointImpl$2.process(WSEndpointImpl.java:419)\n\tat
        com.sun.xml.ws.transport.http.HttpAdapter$HttpToolkit.handle(HttpAdapter.java:868)\n\tat
        com.sun.xml.ws.transport.http.HttpAdapter.handle(HttpAdapter.java:422)\n\tat
        com.sun.xml.ws.transport.http.servlet.ServletAdapter.handle(ServletAdapter.java:169)\n\tat
        weblogic.wsee.jaxws.WLSServletAdapter.handle(WLSServletAdapter.java:246)\n\tat
        weblogic.wsee.jaxws.HttpServletAdapter$AuthorizedInvoke.run(HttpServletAdapter.java:667)\n\tat
        weblogic.security.acl.internal.AuthenticatedSubject.doAs(AuthenticatedSubject.java:386)\n\tat
        weblogic.security.service.SecurityManager.runAs(SecurityManager.java:163)\n\tat
        weblogic.wsee.util.ServerSecurityHelper.authenticatedInvoke(ServerSecurityHelper.java:108)\n\tat
        weblogic.wsee.jaxws.HttpServletAdapter$3.run(HttpServletAdapter.java:286)\n\tat
        weblogic.wsee.jaxws.HttpServletAdapter.post(HttpServletAdapter.java:295)\n\tat
        weblogic.wsee.jaxws.JAXWSServlet.doRequest(JAXWSServlet.java:128)\n\tat weblogic.servlet.http.AbstractAsyncServlet.service(AbstractAsyncServlet.java:103)\n\tat
        javax.servlet.http.HttpServlet.service(HttpServlet.java:790)\n\tat weblogic.servlet.internal.StubSecurityHelper$ServletServiceAction.run(StubSecurityHelper.java:295)\n\tat
        weblogic.servlet.internal.StubSecurityHelper$ServletServiceAction.run(StubSecurityHelper.java:260)\n\tat
        weblogic.servlet.internal.StubSecurityHelper.invokeServlet(StubSecurityHelper.java:137)\n\tat
        weblogic.servlet.internal.ServletStubImpl.execute(ServletStubImpl.java:353)\n\tat
        weblogic.servlet.internal.ServletStubImpl.execute(ServletStubImpl.java:250)\n\tat
        weblogic.servlet.internal.WebAppServletContext$ServletInvocationAction.wrapRun(WebAppServletContext.java:3796)\n\tat
        weblogic.servlet.internal.WebAppServletContext$ServletInvocationAction.run(WebAppServletContext.java:3766)\n\tat
        weblogic.security.acl.internal.AuthenticatedSubject.doAs(AuthenticatedSubject.java:344)\n\tat
        weblogic.security.service.SecurityManager.runAsForUserCode(SecurityManager.java:197)\n\tat
        weblogic.servlet.provider.WlsSecurityProvider.runAsForUserCode(WlsSecurityProvider.java:203)\n\tat
        weblogic.servlet.provider.WlsSubjectHandle.run(WlsSubjectHandle.java:71)\n\tat
        weblogic.servlet.internal.WebAppServletContext.doSecuredExecute(WebAppServletContext.java:2454)\n\tat
        weblogic.servlet.internal.WebAppServletContext.securedExecute(WebAppServletContext.java:2302)\n\tat
        weblogic.servlet.internal.WebAppServletContext.execute(WebAppServletContext.java:2280)\n\tat
        weblogic.servlet.internal.ServletRequestImpl.runInternal(ServletRequestImpl.java:1739)\n\tat
        weblogic.servlet.internal.ServletRequestImpl.run(ServletRequestImpl.java:1699)\n\tat
        weblogic.servlet.provider.ContainerSupportProviderImpl$WlsRequestExecutor.run(ContainerSupportProviderImpl.java:272)\n\tat
        weblogic.invocation.ComponentInvocationContextManager._runAs(ComponentInvocationContextManager.java:352)\n\tat
        weblogic.invocation.ComponentInvocationContextManager.runAs(ComponentInvocationContextManager.java:337)\n\tat
        weblogic.work.LivePartitionUtility.doRunWorkUnderContext(LivePartitionUtility.java:57)\n\tat
        weblogic.work.PartitionUtility.runWorkUnderContext(PartitionUtility.java:41)\n\tat
        weblogic.work.SelfTuningWorkManagerImpl.runWorkUnderContext(SelfTuningWorkManagerImpl.java:655)\n\tat
        weblogic.work.ExecuteThread.execute(ExecuteThread.java:420)\n\tat weblogic.work.ExecuteThread.run(ExecuteThread.java:360)\n</faultstring></ns0:Fault></S:Body></S:Envelope>"
  recorded_at: Tue, 26 Mar 2024 18:20:35 GMT
recorded_with: VCR 6.2.0
